present_graveyard_market/app/Http/Controllers/ItemController.php

select * from `items`
---
    public function index()
    {
        return view('items.index', [
            'title' => config('app.name'),
            'items' => Item::all()

insert into `items` (`user_id`, `name`, `description`, `price`, `category_id`, `image`, `updated_at`, `created_at`) values (1, 'a@a', 'a@a', '5', '2', 'public/44EoIRP69PGSRXbd6Q5hof3ZTBPTYmmqGD6uUcwj.jpg', '2022-06-19 20:17:04', '2022-06-19 20:17:04')
---
    public function store(ItemRequest $request, UpImageServices $UpImage)
    {
        Item::create([
            'user_id' => Auth::user()->id,
            'name' => $request->name,
            'description' => $request->description,
            'price' => $request->price,
            'category_id' => $request->category,
            'image' => $UpImage->UpImage($request->image,''),
        ]);