present_graveyard_market/app/Http/Controllers/UserController.php

select * from `orders` inner join `items` on `items`.`id` = `orders`.`item_id` where `orders`.`user_id` = 1
---
    public function orders()
    {
        $title = '購入した商品';
        $items = Auth::user()->order;