present_graveyard_market/app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('a@a', 'a@a', '$2y$10$WCMTk1KAoMZ5Tgt5JsE.Xe2KSr/XxoO39XXODYwHV5hhdzoG18rem', '2022-06-19 20:16:49', '2022-06-19 20:16:49')
---
    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);